bdring/Grbl_Esp32/Grbl_Esp32/cpu_map.h
#ifdef CPU_MAP_SERVO_AXIS  // The Buildlog.net pen laser controller V1

		// For pen mode be sure to uncomment #define USE_PEN_SERVO in config.h
		// For solenoid  mode be sure to uncomment #define USE_PEN_SERVO in config.h
		// For laser mode, you do not need to change anything
		// Note: You can use all 3 modes at the same time if you want
		
		#define CPU_MAP_NAME "CPU_MAP_SERVO_AXIS"
		
		// Pick a board version
		//#define PEN_LASER_V1
		#define PEN_LASER_V2

		#define X_STEP_PIN      GPIO_NUM_12
		//#define Y_STEP_PIN      GPIO_NUM_14		
		#define X_DIRECTION_PIN   GPIO_NUM_26
		//#define Y_DIRECTION_PIN   GPIO_NUM_25  
		
		#define STEPPERS_DISABLE_PIN GPIO_NUM_13
		
		#ifdef PEN_LASER_V1
			#define X_LIMIT_PIN      	GPIO_NUM_2
		#endif
		#ifdef PEN_LASER_V2
			#define X_LIMIT_PIN      	GPIO_NUM_15
		#endif		
		#define Y_LIMIT_PIN      	GPIO_NUM_4
		#define LIMIT_MASK      	B11				
		
		// If SPINDLE_PWM_PIN is commented out, this frees up the pin, but Grbl will still
		// use a virtual spindle. Do not comment out the other parameters for the spindle.
		#define SPINDLE_PWM_PIN    GPIO_NUM_17 // Laser PWM
		#define SPINDLE_PWM_CHANNEL 0
		// PWM Generator is based on 80,000,000 Hz counter
		// Therefor the freq determines the resolution
		// 80,000,000 / freq = max resolution
		// For 5000 that is 80,000,000 / 5000 = 16000 
		// round down to nearest bit count for SPINDLE_PWM_MAX_VALUE = 13bits (8192)
		#define SPINDLE_PWM_BASE_FREQ 5000 // Hz
		#define SPINDLE_PWM_BIT_PRECISION 8   // be sure to match this with SPINDLE_PWM_MAX_VALUE
		#define SPINDLE_PWM_OFF_VALUE     0
		#define SPINDLE_PWM_MAX_VALUE     255 // (2^SPINDLE_PWM_BIT_PRECISION)
		
		#ifndef SPINDLE_PWM_MIN_VALUE
				#define SPINDLE_PWM_MIN_VALUE   1   // Must be greater than zero.
		#endif
		
		#define SPINDLE_PWM_RANGE         (SPINDLE_PWM_MAX_VALUE-SPINDLE_PWM_MIN_VALUE)			
		
		#define SERVO_Y_PIN 					GPIO_NUM_14
		#define SERVO_Y_CHANNEL_NUM 	6
		#define SERVO_Y_RANGE_MIN			0.0
		#define SERVO_Y_RANGE_MAX			30.0
		
		#define SERVO_Z_PIN 					GPIO_NUM_27
		#define SERVO_Z_CHANNEL_NUM 	5
		#define SERVO_Z_RANGE_MIN			0.0
		#define SERVO_Z_RANGE_MAX			20.0
		
		
		#ifdef DEFAULTS_GENERIC 
			#undef DEFAULTS_GENERIC  // undefine generic then define each default below
		#endif
		
		// defaults
		#define DEFAULT_STEP_PULSE_MICROSECONDS 3 
		#define DEFAULT_STEPPER_IDLE_LOCK_TIME 250 // stay on
		
		#define DEFAULT_STEPPING_INVERT_MASK 0 // uint8_t
		#define DEFAULT_DIRECTION_INVERT_MASK 0 // uint8_t
		#define DEFAULT_INVERT_ST_ENABLE 0 // boolean
		#define DEFAULT_INVERT_LIMIT_PINS 1 // boolean
		#define DEFAULT_INVERT_PROBE_PIN 0 // boolean 
		
		#define DEFAULT_STATUS_REPORT_MASK 1
		
		#define DEFAULT_JUNCTION_DEVIATION 0.01 // mm
		#define DEFAULT_ARC_TOLERANCE 0.002 // mm
		#define DEFAULT_REPORT_INCHES 0 // false
		
		#define DEFAULT_SOFT_LIMIT_ENABLE 0 // false
		#define DEFAULT_HARD_LIMIT_ENABLE 0  // false
		
		#define DEFAULT_HOMING_ENABLE 0  
		#define DEFAULT_HOMING_DIR_MASK 0 // move positive dir Z, negative X,Y
		#define DEFAULT_HOMING_FEED_RATE 200.0 // mm/min
		#define DEFAULT_HOMING_SEEK_RATE 1000.0 // mm/min
		#define DEFAULT_HOMING_DEBOUNCE_DELAY 250 // msec (0-65k)
		#define DEFAULT_HOMING_PULLOFF 3.0 // mm

		#define DEFAULT_SPINDLE_RPM_MAX 1000.0 // rpm
		#define DEFAULT_SPINDLE_RPM_MIN 0.0 // rpm
		
		#define DEFAULT_LASER_MODE 0 // false
		
		#define DEFAULT_X_STEPS_PER_MM 40      // half turn on a stepper
		#define DEFAULT_Y_STEPS_PER_MM 100.0  // default calibration value
		#define DEFAULT_Z_STEPS_PER_MM 100.0 // default calibration value
		
		#define DEFAULT_X_MAX_RATE 2000.0 // mm/min
		#define DEFAULT_Y_MAX_RATE 2000.0 // mm/min
		#define DEFAULT_Z_MAX_RATE 2000.0 // mm/min
		
		#define DEFAULT_X_ACCELERATION (50.0*60*60) // 10*60*60 mm/min^2 = 10 mm/sec^2
		#define DEFAULT_Y_ACCELERATION (50.0*60*60) // 10*60*60 mm/min^2 = 10 mm/sec^2
		#define DEFAULT_Z_ACCELERATION (50.0*60*60) 
		
		#define DEFAULT_X_MAX_TRAVEL 300.0 // mm NOTE: Must be a positive value.
		#define DEFAULT_Y_MAX_TRAVEL 100.0 // default calibration value
		#define DEFAULT_Z_MAX_TRAVEL 100.0 // default calibration value
		
		
#endif


#ifdef CPU_MAP_SM // String art machine definition
	

		#define X_STEP_PIN      GPIO_NUM_12
		#define X_DIRECTION_PIN   GPIO_NUM_26
		
		#define STEPPERS_DISABLE_PIN GPIO_NUM_13		
		
		#define X_LIMIT_PIN      	GPIO_NUM_15
		#define LIMIT_MASK      	B1			
		
		// If SPINDLE_PWM_PIN is commented out, this frees up the pin, but Grbl will still
		// use a virtual spindle. Do not comment out the other parameters for the spindle.
		#define SPINDLE_PWM_PIN    GPIO_NUM_17 // Laser PWM
		#define SPINDLE_PWM_CHANNEL 0
		// PWM Generator is based on 80,000,000 Hz counter
		// Therefor the freq determines the resolution
		// 80,000,000 / freq = max resolution
		// For 5000 that is 80,000,000 / 5000 = 16000 
		// round down to nearest bit count for SPINDLE_PWM_MAX_VALUE = 13bits (8192)
		#define SPINDLE_PWM_BASE_FREQ 5000 // Hz
		#define SPINDLE_PWM_BIT_PRECISION 8   // be sure to match this with SPINDLE_PWM_MAX_VALUE
		#define SPINDLE_PWM_OFF_VALUE     0
		#define SPINDLE_PWM_MAX_VALUE     255 // (2^SPINDLE_PWM_BIT_PRECISION)
		
		#ifndef SPINDLE_PWM_MIN_VALUE
				#define SPINDLE_PWM_MIN_VALUE   1   // Must be greater than zero.
		#endif
		
		#define SPINDLE_PWM_RANGE         (SPINDLE_PWM_MAX_VALUE-SPINDLE_PWM_MIN_VALUE)			
		
		// define Y and Z as servos
		#define USE_SERVO_AXES
		#define SERVO_Y_PIN 					GPIO_NUM_27
		#define SERVO_Y_CHANNEL_NUM 	6
		#define SERVO_Y_RANGE_MIN			0.0
		#define SERVO_Y_RANGE_MAX			20.0
		
		#define SERVO_Z_PIN 					GPIO_NUM_14
		#define SERVO_Z_CHANNEL_NUM 	5
		#define SERVO_Z_RANGE_MIN			0.0
		#define SERVO_Z_RANGE_MAX			28.0		
		
		// define the control pins
		//#define CONTROL_RESET_PIN         GPIO_NUM_36  // needs external pullup
		#define CONTROL_FEED_HOLD_PIN     GPIO_NUM_34  // needs external pullup
		#define CONTROL_CYCLE_START_PIN   GPIO_NUM_39  // needs external pullup
		
		// change some things that may have been defined in config.h
		#ifndef IGNORE_CONTROL_PINS
			#define IGNORE_CONTROL_PINS
		#endif
		#ifdef INVERT_CONTROL_PIN_MASK
			#undef INVERT_CONTROL_PIN_MASK
		#endif
		#define INVERT_CONTROL_PIN_MASK   B1100
		

		// clear any default homings and set X as the only one
		#ifdef HOMING_CYCLE_0
			#undef HOMING_CYCLE_0
		#endif
		#define HOMING_CYCLE_0 (1<<X_AXIS) 
		#ifdef HOMING_CYCLE_1
			#undef HOMING_CYCLE_1
		#endif
		#ifdef HOMING_CYCLE_2
			#undef HOMING_CYCLE_2
		#endif		
				
		#ifdef DEFAULTS_GENERIC 
			#undef DEFAULTS_GENERIC  // undefine generic then define each default below
		#endif
		
