bdring/Grbl_Esp32/Grbl_Esp32/cpu_map.h
		// defaults
		#define DEFAULT_STEP_PULSE_MICROSECONDS 3 
		#define DEFAULT_STEPPER_IDLE_LOCK_TIME 255 // stay on
		
		#define DEFAULT_STEPPING_INVERT_MASK 0 // uint8_t
		#define DEFAULT_DIRECTION_INVERT_MASK 6 // Y and Z need to be inverted
		#define DEFAULT_INVERT_ST_ENABLE 0 // boolean
		#define DEFAULT_INVERT_LIMIT_PINS 1 // boolean
		#define DEFAULT_INVERT_PROBE_PIN 0 // boolean 
		
		#define DEFAULT_STATUS_REPORT_MASK 1
		
		#define DEFAULT_JUNCTION_DEVIATION 0.01 // mm
		#define DEFAULT_ARC_TOLERANCE 0.002 // mm
		#define DEFAULT_REPORT_INCHES 0 // false
		
		#define DEFAULT_SOFT_LIMIT_ENABLE 0 // false
		#define DEFAULT_HARD_LIMIT_ENABLE 0  // false
		
		#define DEFAULT_HOMING_ENABLE 1  
		#define DEFAULT_HOMING_DIR_MASK 0 // move positive dir Z, negative X,Y
		#define DEFAULT_HOMING_FEED_RATE 25.0 // mm/min
		#define DEFAULT_HOMING_SEEK_RATE 600.0 // mm/min
		#define DEFAULT_HOMING_DEBOUNCE_DELAY 250 // msec (0-65k)
		#define DEFAULT_HOMING_PULLOFF 1.0 // mm

		#define DEFAULT_SPINDLE_RPM_MAX 1000.0 // rpm
		#define DEFAULT_SPINDLE_RPM_MIN 0.0 // rpm
		
		#define DEFAULT_LASER_MODE 0 // false
		
		#define DEFAULT_X_STEPS_PER_MM 300.0
		#define DEFAULT_Y_STEPS_PER_MM 100.0   // This is percent in servo mode...used for calibration
		#define DEFAULT_Z_STEPS_PER_MM 100.0 // This is percent in servo mode...used for calibration
		
		#define DEFAULT_X_MAX_RATE 8000.0 // mm/min
		#define DEFAULT_Y_MAX_RATE 4000.0 // mm/min
		#define DEFAULT_Z_MAX_RATE 4000.0 // mm/min
		
		#define DEFAULT_X_ACCELERATION (150.0*60*60) // 10*60*60 mm/min^2 = 10 mm/sec^2
		#define DEFAULT_Y_ACCELERATION (200.0*60*60) // 10*60*60 mm/min^2 = 10 mm/sec^2
		#define DEFAULT_Z_ACCELERATION (200.0*60*60) 
		
		#define DEFAULT_X_MAX_TRAVEL 100000.0 // mm NOTE: Must be a positive value.
		#define DEFAULT_Y_MAX_TRAVEL 100.0 // This is percent in servo mode...used for calibration
		#define DEFAULT_Z_MAX_TRAVEL 100.0 // This is percent in servo mode...used for calibration
		
		
#endif

#ifdef CPU_MAP_MPCNC_V1P2
	// This is the CPU Map for the Buildlog.net MPCNC controller
	
		#define CPU_MAP_NAME "CPU_MAP_MPCNC_V1P2"
	
		// switch to the correct default settings
		#ifdef DEFAULTS_GENERIC
			#undef DEFAULTS_GENERIC
		#endif
		#define DEFAULTS_MPCNC
		
	
		#define USE_GANGED_AXES // allow two motors on an axis 
	  
		#define X_STEP_PIN      GPIO_NUM_12
		#define X_STEP_B_PIN    GPIO_NUM_22	 // ganged motor
		#define X_AXIS_SQUARING
		
		#define Y_STEP_PIN      GPIO_NUM_14
		#define Y_STEP_B_PIN    GPIO_NUM_21  // ganged motor
		#define Y_AXIS_SQUARING
		
		#define Z_STEP_PIN      GPIO_NUM_27
		
		#define X_DIRECTION_PIN   GPIO_NUM_26
		#define Y_DIRECTION_PIN   GPIO_NUM_25  
		#define Z_DIRECTION_PIN   GPIO_NUM_33 
		
		// OK to comment out to use pin for other features
		#define STEPPERS_DISABLE_PIN GPIO_NUM_13				
				
		// Note: if you use PWM rather than relay, you could map GPIO_NUM_2 to mist or flood 
		//#define USE_SPINDLE_RELAY
		
		#ifdef USE_SPINDLE_RELAY		
			#define SPINDLE_PWM_PIN    GPIO_NUM_2
		#else
			#define SPINDLE_PWM_PIN    GPIO_NUM_16
			#define SPINDLE_ENABLE_PIN	GPIO_NUM_32
		#endif
		
		#define SPINDLE_PWM_CHANNEL 0
		// PWM Generator is based on 80,000,000 Hz counter
		// Therefor the freq determines the resolution
		// 80,000,000 / freq = max resolution
		// For 5000 that is 80,000,000 / 5000 = 16000 
		// round down to nearest bit count for SPINDLE_PWM_MAX_VALUE = 13bits (8192)
		#define SPINDLE_PWM_BASE_FREQ 5000 // Hz
		#define SPINDLE_PWM_BIT_PRECISION 8   // be sure to match this with SPINDLE_PWM_MAX_VALUE
		#define SPINDLE_PWM_OFF_VALUE     0
		#define SPINDLE_PWM_MAX_VALUE     255 // (2^SPINDLE_PWM_BIT_PRECISION)
		
		#ifndef SPINDLE_PWM_MIN_VALUE
				#define SPINDLE_PWM_MIN_VALUE   1   // Must be greater than zero.
		#endif
		
		#define SPINDLE_PWM_RANGE         (SPINDLE_PWM_MAX_VALUE-SPINDLE_PWM_MIN_VALUE)		
		
		// Note: Only uncomment this if USE_SPINDLE_RELAY is commented out.
		// Relay can be used for Spindle or Coolant
		//#define COOLANT_FLOOD_PIN 	GPIO_NUM_2
		
		#define X_LIMIT_PIN      	GPIO_NUM_17 
		#define Y_LIMIT_PIN      	GPIO_NUM_4  
		#define Z_LIMIT_PIN     	GPIO_NUM_15 	
		#define LIMIT_MASK      	B111
		
		#ifndef ENABLE_SOFTWARE_DEBOUNCE   // V1P2 does not have R/C filters
			#define ENABLE_SOFTWARE_DEBOUNCE
		#endif
		
		#define PROBE_PIN       	GPIO_NUM_35  
		
		// The default value in config.h is wrong for this controller
		#ifdef INVERT_CONTROL_PIN_MASK
			#undef INVERT_CONTROL_PIN_MASK			
		#endif
		
		#define INVERT_CONTROL_PIN_MASK   B1110
		
		// Note: defualt is #define IGNORE_CONTROL_PINS in config.h
		// uncomment to these lines to use them		
		#ifdef IGNORE_CONTROL_PINS
			#undef IGNORE_CONTROL_PINS
		#endif
		
		
		
		
		#define CONTROL_RESET_PIN         GPIO_NUM_34  // needs external pullup
		#define CONTROL_FEED_HOLD_PIN     GPIO_NUM_36  // needs external pullup 
		#define CONTROL_CYCLE_START_PIN   GPIO_NUM_39  // needs external pullup    		
		
#endif

#ifdef CPU_MAP_MPCNC_V1P1
	// This is the CPU Map for the Buildlog.net MPCNC controller
	
		#define CPU_MAP_NAME "CPU_MAP_MPCNC_V1P1"
	
		// switch to the correct default settings
		#ifdef DEFAULTS_GENERIC
			#undef DEFAULTS_GENERIC
		#endif
		#define DEFAULTS_MPCNC
		
	
		#define USE_GANGED_AXES // allow two motors on an axis 
	  
		#define X_STEP_PIN      GPIO_NUM_12
		#define X_STEP_B_PIN    GPIO_NUM_22	 // ganged motor
		#define X_AXIS_SQUARING
		
		#define Y_STEP_PIN      GPIO_NUM_14
		#define Y_STEP_B_PIN    GPIO_NUM_21  // ganged motor
		#define Y_AXIS_SQUARING
		
		#define Z_STEP_PIN      GPIO_NUM_27
		
		#define X_DIRECTION_PIN   GPIO_NUM_26
		#define Y_DIRECTION_PIN   GPIO_NUM_25  
		#define Z_DIRECTION_PIN   GPIO_NUM_33 
		
		// OK to comment out to use pin for other features
		#define STEPPERS_DISABLE_PIN GPIO_NUM_13		
		
				
		// Note: if you use PWM rather than relay, you could map GPIO_NUM_17 to mist or flood 
		#define USE_SPINDLE_RELAY
		
		#ifdef USE_SPINDLE_RELAY		
			#define SPINDLE_PWM_PIN    GPIO_NUM_17
		#else
			#define SPINDLE_PWM_PIN    GPIO_NUM_16
			#define SPINDLE_ENABLE_PIN	GPIO_NUM_32
		#endif
		
